Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N04.tmx
Source language: en_us
Languages: zh_cn

source: The marriage had ended shortly before he moved away, but Zichen had used him to excuse herself from two years of social life.
zh_cn: 刚一离婚他就搬走了，但是自晨拿他当了两年挡箭牌，拒绝了一切社会交往。

source: The cheek of it.
zh_cn: 真是不知羞。

source: When she lied to Henry and Ted, she could hear her grandmother's words, those she would say after Zichen had read her report card aloud in the shop.
zh_cn: 当她朝亨利和泰德撒谎时，她仿佛听见外婆对她说的这句话，小时候当自晨在店里大声把老师的评语念给她听后，外婆就会这么说。

source: Unable to concentrate, the teachers commented every year; a lack of interest in both studying and participating in school activities.
zh_cn: 注意力不集中，老师年年这么写，学习不上进，对学校活动也不积极。

source: Her grades were meagre, barely good enough for her to proceed to the next level.
zh_cn: 她的成绩很可怜，勉强不被留级。

source: What will you do with your life if you don't catch up with your schoolwork? her grandmother's customers ceaselessly asked her; not knowing the answer, she would smile as though she did not understand the question, and it was her smile more than her grades that had marked her as beyond teachable.
zh_cn: 你不好好读书将来打算怎么办？外婆的顾客老是这么问她。不知道答案，她只好又微笑，装作没听懂问题。她的微笑，比起她的成绩，更是给她贴上了“朽木难雕”的标签。

source: Zichen had given Henry and Ted a skeletal account of her divorce the third year into her work, as it had not felt right to continue to lie about a marriage that no longer existed.
zh_cn: 工作的第三年，自晨简短地告诉亨利和泰德自己离婚了，因为继续谎称拥有一场不再存在的婚姻感觉不大对劲。

source: But an ex-husband was easy to be done with and never mentioned again, while a pair of parents, even if they lived on another continent, needed careful maintenance: an annual trip; phone calls that brought news from China; presents to take home- Wisconsin ginseng for her father, anti-aging cream for her mother.
zh_cn: 不过，一个前夫三言两语就能蒙混过去，而且不会再提起，但是一双父母，就算他们住在大洋彼岸，仍需要小心维持：一年一度的旅行；打电话时听说的中国的消息；带回家的礼物——送给父亲的威斯康辛花旗参，送给母亲的抗老霜。

source: She could easily take the usual trip back to China this year, a routine unbroken, thus causing little concern or suspense, but the truth was the shack that had housed her grandmother's shop had been demolished, her grandmother reduced to an urn of ashes.
zh_cn: 今年她本可以也像往常一样简简单单回趟中国，这是每年不变的惯例，不会引起注意和怀疑。可是，理发店的棚子已经被拆除，外婆也已成了一瓮骨灰。

source: Her grandmother had lived in the shop until a month before her death, at ninety-three, and Zichen knew that for as long as her grandmother had lived there the shop door was opened every morning, the fluorescent light kept on till closing time, as it was during her annual visits.
zh_cn: 她的外婆直到死前的一个月还住在店里，那时她已经93岁了。自晨知道，只要外婆住在那儿，从早上起店门就会开着，日光灯也会一直亮着，直到关门。她每年回去时都是如此。

source: The news of the death had reached Zichen after the funeral; she had not been invited to it, as she knew her mother had not been.
zh_cn: 在葬礼之后自晨才得到外婆去世的消息；她没被邀请出席葬礼，她知道她的母亲一定也没有。

source: Together they, rather than an early widowhood, were blamed for her grandmother's harsh life; together they had been the old woman's disappointments, a daughter who had brought humiliation to the family, a granddaughter who had rashly married a man she had met twice and had then been unable to stay married for longer than three years.
zh_cn: 人们指责说，外婆辛劳一生不是因为早寡，而是因为她们母女俩；她俩成了这位老太太的心头之痛，女儿给整个家带来耻辱，外孙女草草嫁给一个仅仅见面两次的男人，而且不到三年就离了婚。

source: The B. and B. was in a village called Neville Hill, some distance from Brighton, but to simplify the matter Zichen told Ted and Henry that Brighton was her final destination.
zh_cn: 那家小旅馆位于一个叫做内维尔山的小村里，离布赖顿有段距离，但为了省事，自晨告诉泰德和亨利，布赖顿就是她的旅行目的地。

source: They were eating lunch together, savoring one of the last warm autumn days before a cold front set in.
zh_cn: 他们一起吃着午餐，享受着冷锋到来前的最后几天温暖的秋日。

source: She described the places she wanted to see: the promenade, the beach, the English Channel.
zh_cn: 她描述自己想去看的地方：布赖顿的海滨大道，海滩，还有英吉利海峡。

source: "Now, explain two things to me," Ted said, and for a moment Zichen thought Henry looked relieved that someone was going to confront her as he would never do.
zh_cn: “好吧，给我解释两件事，”泰德说。有那么一瞬间，自晨觉得亨利看起来像是松了口气，因为终于有人站出来和她正正经经地说说这件事了，他自己反正是不会这么做的。

source: "First, why do you want to go to the beach in the winter?"
zh_cn: “第一，为什么你想在冬天去海滩？”

source: November was not winter yet, Zichen argued, and Ted merely nodded at her with a triumphant smile as though he had cornered a runaway rat that Zichen wasn't able to catch.
zh_cn: 十一月份还不算冬天，自晨争辩道，但是泰德只是带着胜利的笑容冲她点了点头，就好像他把一只自晨没能抓牢而逃出来的老鼠赶进了死角一样。

source: It was rare that a mouse or a rat slipped through her grip, and when it did happen- a few times over the years- Ted would talk about it for days afterward with a childlike glee.
zh_cn: 很少有老鼠能从自晨的手里溜出去，但是当这种事情发生之后——这些年来就发生过几次——泰德一连几天都会揪着这个话题不放，高兴得像个小孩。

source: When you touch an animal, it can tell right away if you are nervous or if you are the master, Henry had explained to Zichen when he trained her.
zh_cn: 当你去摸一只动物，它能立马判断出你是紧张还是自信，亨利给自晨培训的时候这样说到。

source: Ted, during the first weeks, had liked to seek her out and tell her gruesome tales; his favorite one concerned a homemade rat guillotine that he and Henry had once built for a neurologist's study.
zh_cn: 泰德，在头几周，喜欢找到自晨给她讲些恶心吓人的故事；他最得意的那个，讲的是有一次他和亨利给一位神经病学家自制了一架给大鼠用的断头台。

source: But to her co-workers' surprise Zichen had never been jittery.
zh_cn: 但自晨并没有被吓着，这让她的两位同事很是吃惊。

source: She had applied for the opening because she had no other profitable skills, but in retrospect she wondered if she had found the right job out of blind luck.
zh_cn: 她之所以申请这儿的空缺职位，是因为她没有别的什么一技之长，但回头想想，她误打误撞找着的这份工作似乎是为自己量身准备的。

source: From the beginning, she had clipped a mouse's ear or prepped a rat for a skin graft as deftly as if she had always worked with animals.
zh_cn: 从一开始，她便能熟练地剪掉小鼠的耳朵或者给大鼠做好皮片移植的术前准备，就像她此前一直同动物打交道似的。

source: Even the bigger mammals had not distressed her: the monkeys that clamored in the cages and made faces at her when she came in with feed or a hose, the forlorn-looking dogs that rarely barked.
zh_cn: 她也不怕更大一些的哺乳动物：那些在笼子里吵吵嚷嚷的猴子，当她去给它们喂食或是冲澡的时候，冲着她直做鬼脸；还有那些可怜兮兮从不叫唤的狗。

source: After her training, Henry had told her that he and Ted would split the care of bigger mammals because they thought her too small, for instance, to dispose of a thirty-pound carcass by herself.
zh_cn: 她的培训结束之后，亨利告诉她，以后照顾大点的哺乳动物的任务就由他和泰德分担了，因为他们觉得她太瘦小了，有些活，比如处理掉十几公斤的动物尸体，可能干不了。

source: The Rodent Queen- on her thirtieth birthday, they had left a toy crown on her desk, the words scrawled on with permanent marker.
zh_cn: 在她三十岁那天，他们在她的办公桌上留了一个玩具皇冠，上面用不褪色的马克笔写着——啮齿类女王。

source: "Now, winter or not winter," Ted said.
zh_cn: “好吧，不说冬天不冬天的了，”泰德说。

source: "Why do you want to go to England all by yourself?"
zh_cn: “为什么你想要一个人去英国？”

source: People travelled alone all the time, Zichen said, and there was nothing wrong with that.
zh_cn: 一个人旅游很常见，自晨说，这没什么不对的地方啊。

source: "But what are you going to do in a place where you don't know anyone?"
zh_cn: “但是你跑到一个谁都不认识的地方去干什么呢？”

source: "How do you know I don't know anyone there?" Zichen said, but the moment the words came out she regretted them.
zh_cn: “你怎么知道我在那儿谁都不认识？”自晨说，话一出口，她就后悔了。

source: Over the years she had become accustomed to who she was in other people's eyes: she knew she would be considered a loser by her Chinese acquaintances in America, a divorced woman toiling her life away in an animal-care facility, someone who had failed to make it;
zh_cn: 多年以来，她已经习惯了自己在他人眼中的形象：她知道，在美国的华裔熟人看起来，她过得很失败，一个离异的女人，在一家动物关爱机构干着苦活，养活自己都成问题；

source: in her landlord's and neighbors' eyes she was the quiet, good-mannered foreigner who paid her rent on time, who every Halloween put out a couple of pumpkins, uncarved but with drawn-on eyes and mouths, and who had no visitors on weekends or holidays, so there was no conflict regarding the guest parking;
zh_cn: 在房东和邻居眼里，她是个安安静静、彬彬有礼的外国人，房租按时交，每年万圣节在门外挂一两个南瓜——没有雕空成鬼脸，眼睛和嘴都只是用笔画上，周末或假期时也从没有人来拜访，因而从没因为来客乱停车而引起口角；

source: for her grandmother and her aging customers, who spent their days in the shack for conversation and companionship more than for the care of their thinning hair or balding heads, she was- despite being a baby who should have remained unborn, a child with little merit and an unnerving manner, and a young woman who had no respect for marriage or her own future- a proof, in the end, of the ultimate mercy of life.
zh_cn: 而在外婆和她的那些上了年岁的顾客眼里（他们整日呆在棚子里，与其说是为了给日渐稀疏的头发或者说日渐光秃的脑袋做些护理，不如说是来闲谈，好彼此做个伴），尽管她曾是个不该出生的婴儿，是个一无是处、让人心里发毛的小孩，是个把自己的婚姻和前程当做儿戏的少女，但归根结底，她是“天无绝人之路”的一个活生生的实例。

source: She had been able to build a life out of her failures, to wire dollars to her grandmother, to return every year like a loyal homing pigeon and sit with the old customers, still with that unnerving smile on her face although they no longer cared; simply sitting with them and listening to them had absolved Zichen of all possible sins.
zh_cn: 她摆脱了失败，过上了像样的生活，给外婆寄钱回来，像一只忠诚的家鸽一样每年回来看看，陪着那些老主顾们坐着，脸上仍然挂着那副令人发毛的微笑，不过他们都已经不再在乎了。仅仅是陪他们坐着、听他们说话，就赦免了自晨一切或有或无的罪孽。

source: But it was who she was in the eyes of Henry and Ted that she cherished the most: sure-handed and efficient at her job, quiet yet at times chatty, uncomplicated.
zh_cn: 但她最珍视的，是自己在亨利和泰德眼中的形象：工作老练而麻利，话不多但偶尔也有说个不停的时候，单纯简单。

source: That she had memorized passages from "Winnie-the-Pooh," that she had read its Latin translation before reading the English text, she did not share with them, because that would make her an eccentric in their eyes.
zh_cn: 然而她能背出《小熊维尼》里的许多章节，而且她是先读了拉丁文译版本后，再去读的英文版，这些她都没有与他们分享，否则在他们眼中她会变成一个怪人。

source: The things that gave her pleasure- the pile of wood shavings meant for the animals' bedding, which she assembled into small hills;
zh_cn: 还有那些她爱做的事：把用来给动物垫窝的木屑堆成一座座小山；

source: the time she spent imagining her ex-husband in a pale-blue suburban house in New Jersey, his two sons growing up and looking more like him each year, his new wife unaging;
zh_cn: 想象前夫住在新泽西郊区的一座浅蓝色的房子里，他的两个儿子慢慢长大，年复一年长得越发地像他，他新找的妻子永远年轻；

source: the marriage she had given her father, whom she had never known, and her mother, whom she had met only once, in a small one-bedroom apartment in an older neighborhood in Beijing- these she did not share with Henry and Ted, because they would have made her a person with a history, in this or that time, this or that place.
zh_cn: 为她未曾谋面的父亲和只见过一面的母亲设定婚后的生活，就在北京的一套一居室的公寓里，邻居都是些老人——这一切她也没和亨利与泰德分享，因为这会使她变得不再那么简单，在过去或现在，在此地或别处，都有着一言难尽的故事。

source: "So, you are meeting someone in England?" Ted said.
zh_cn: “这么说，你要去英国见什么人喽？”泰德问。

source: "No," Zichen said.
zh_cn: “没，”自晨说。

source: "Why should I?"
zh_cn: “凭什么非得见什么人？”

source: The unusual confrontational tone in her reply made Ted flinch, as though he had trespassed.
zh_cn: 她的回答充满了不寻常的火药味，使泰德向后一缩，就像被打了一耳光。

source: He shrugged and, with a theatrical gesture, threw a half-eaten sandwich to a squirrel.
zh_cn: 他耸耸肩，动作夸张地把吃了一半的三明治扔给了一只松鼠。

source: Years earlier, Molly, Ted's wife, had asked Zichen if she wanted to meet someone she knew who was available; Henry's wife, Caroline, had mentioned once or twice her Chinese dentist, divorced, according to his office manager.
zh_cn: 几年前，莫莉，泰德的妻子，曾问过自晨想不想去见见她的某个单身的朋友。亨利的妻子，卡洛琳，也有一两次提到过她的华裔牙医，据他的办公室经理说，他已经离婚了。

source: When Zichen had not followed up on either lead, the women had not pressed her.
zh_cn: 但自晨两边的红线都没有跟上，她们也就没有强求了。

source: Henry and Ted had never asked about her personal life.
zh_cn: 亨利和泰德从没过问她的私人生活。

source: The ease into which the three of them had settled left her life outside work irrelevant, and she liked to imagine that for them it was as natural for her to cease to exist the moment she left work as it was natural that she could handle the animals with confidence and calm.
zh_cn: 他们三人身处的这份轻松融洽，使得她工作之外的生活无足轻重。她乐于去想象，他们和自己同样认为，她下班之后就好像不再存在，和她能够自信冷静地处理动物一样，是件很自然的事情。

source: The only time they had experienced discomfort was when Henry first trained her to breed the mice- he had asked Ted to be present when he showed her how to detect vaginal plugs, the evidence of successful copulation.
zh_cn: 唯一一次让他们觉得不自在的，是亨利开始教自晨怎么给老鼠配种的时候——亨利拖上泰德，给她展示怎么检查阴道栓是否形成，这是母鼠成功交配的标志。

source: Beet red, Henry had grabbed a few females to display their private parts to Zichen, then explained that sometimes the plugs did not guarantee pregnancy.
zh_cn: 亨利脸红得像个萝卜，抄起一些母鼠，给自晨看它们的私处，并解释有时候有了阴道栓也不能保证一定受孕。

source: Ted, rearranging the charts on the cages with a look of concentration, had remained uncharacteristically quiet on a subject that he might otherwise have joked about with Henry.
zh_cn: 泰德一脸专注地摆弄着笼子上的表格，不合秉性地保持着沉默，换做其他时候，就这个话题，他早和亨利开起玩笑了。

source: Had Ted been offended by her abruptness, Zichen wondered, but she could not find the words to soften the tension as he continued to whistle to the squirrel, which was ignoring his generosity.
zh_cn: 泰德也许被自己的鲁莽给冒犯了，自晨心想，但是她没办法说些什么来缓和缓和僵局，因为他不停地朝那只松鼠吹着口哨，而后者对他的慷慨无动于衷。

source: She had unwisely opened a door and then clumsily slammed it shut, but perhaps some harm had already been done.
zh_cn: 她冒冒失失地打开一扇门，接着又毛毛糙糙地一把摔上，也许已经造成了伤害。

source: "You'll do just fine," Henry said when it was apparent that Ted would not fill the rest of the lunch break with one of his favorite topics, the upcoming basketball game or a wrestling match.
zh_cn: “也没什么不好的，”亨利开口了，看样子，今天剩下的午休时间里，泰德是不会就自己喜爱的话题，比如即将开战的篮球或摔跤比赛，来说个不停了。

source: "When you think about it, I've seen my share of pictures of China but never any of England."
zh_cn: “仔细想想，我看过你拍的那些中国的相片了，但我还从没看过英格兰的呢。”

source: Zichen took pictures when she travelled to China, of things she imagined Henry might like to see, or of strange sights that would offer Ted an opportunity to criticize.
zh_cn: 自晨回中国时会拍些照片，拍些她认为亨利喜欢看的东西，也拍些奇怪的东西好供泰德品评。

source: Yes, she agreed.
zh_cn: 对，她赞同道。

source: England would be a good change.
zh_cn: 英格兰会是个不错的改变。

source: She then dusted off the crumbs from the picnic table so that they would not find ants crawling over their space the next day.
zh_cn: 说完，她擦去野餐桌上的面包屑，免得第二天发现蚂蚁到处乱爬。

source: Before she had joined them, Henry and Ted used to eat in the office, the door open to the hallway with its constant odor of bleach and rodent pellets and damp bedding and dead animals; they did not seem to be bothered by this, but when Henry noticed that Zichen often sat on the steps in front of the building to eat her lunch, he had requested a picnic table as an improvement for their work environment.
zh_cn: 她加入之前，亨利和泰德都在办公室里吃午餐，他们把门开着，从走廊传来漂白剂、老鼠饲料、潮湿的垫层和死去动物的气味，挥之不去。他们对此似乎并不在意，但当亨利注意到自晨总是坐在门口台阶上吃午饭时，他以改善工作环境为由，申请了一张野餐桌。

source: Josephina, the proprietress of Hydrangea House, had been easy to talk with on the phone.
zh_cn: 乔瑟芬娜，绣球花之家的老板娘，在电话里听起来是个好说话的人。

source: If she had felt curious as to why a woman from America with an unpronounceable Chinese name would want to spend two weeks in Neville Hill she had not shown it.
zh_cn: 一个有着难念的中国名字的美国女人竟然想在内维尔山呆上两个星期，也许她觉得奇怪，但至少没有表现出来。

source: Zichen wondered, after the phone call, whether the thought would be shared with Josephina's husband; she wondered if they would decide that such a question did not matter in a bed-and-breakfast business.
zh_cn: 自晨心想，打完电话后，不知道乔瑟芬娜会不会把自己的好奇说给丈夫听；也许他们认为，旅馆生意就是生意，这算不上什么事。

source: When she got to Neville Hill, Zichen would explain to the owners that she had come in memory of an elderly woman who had befriended her when she first moved to America.
zh_cn: 到了内维尔山之后，她会向旅馆店主解释，她来是为了怀念一位老太太。她初到美国时，两人就成了忘年之交。

source: Margaret was the woman's name.
zh_cn: 这位老太太的名字叫做玛格丽特。

source: She had spent her childhood in Neville Hill before marrying an American pastor, John Hubor, and had lived in the States for fifty-three years.
zh_cn: 她在内维尔山度过了整个童年时光，后来嫁给一位叫做约翰·胡博的美国牧师，余下的53年都住在美国。

source: Would the couple at Hydrangea House try to locate a girl in the village's past, one who had left, taken away by a marriage after the war?
zh_cn: 绣球花之家的店主夫妇会不会回想村庄的过去，试着搜寻一位在战后远嫁他乡的少女呢？

source: Perhaps they had heard of a girl named Margaret, or perhaps they would apologize for having no such recollection.
zh_cn: 也许他们听说过一个叫做玛格丽特的女孩，也许他们会因为想不起来有这么个女孩而表示歉意。

source: The truth was, the name Neville Hill had never been mentioned in any of Zichen's conversations with Margaret, yet it was Neville Hill that Zichen had decided to go to, her research fitting the village to an old woman's descriptions: the school trips to Seaford taken on foot; the car rides to Brighton for special family occasions.
zh_cn: 事实上，在自晨与玛格丽特的交谈中，老太太从未提起内维尔山这个字眼，但是自晨一番研究之后选择了内维尔山，因为这里与老太太的描述最为吻合：学校组织远足时，步行去海福德；特殊的日子里，全家开车去布赖顿。
